let handler  = async (m, { conn }) => { 
 let name = conn.getName(m.sender) 
 let teks = ` 
 ${pickRandom([`'⎔⋅• ━ ╼╃ ⌬〔﷽〕⌬ ╄╾ ━ •⋅⎔
﹝♦↓ اسـتـمـارة الـدخـول ↓♦﹞
⎔⋅• ━ ╼╃ ◈ 〔💧〕 ◈ ╄╾ ━ •⋅⎔
↾🍷↿┊اللـقـب ⇇〔  〕
↾🎥↿┊مـن انـمـي ⇇〔  〕
↾🎎↿┊بـنـت او ولـد ⇇〔  〕
↾🎓↿┊مـن طـرف ⇇〔  〕
↾🌅↿┊صـورة للـقـب ⇇〔  〕
⎔⋅• ━ ╼╃ ◈ 〔💧〕 ◈ ╄╾ ━ •⋅⎔
↾❌↿┊مـمـنـوع الـسـوالـف〕
↾❌↿┊مـمـنـوع القاب الـ 18+〕
↾❌↿┊مـمـنـوع السـب و الـشـتـم〕
⎔⋅• ━ ╼╃ ◈ 〔💧〕 ◈ ╄╾ ━ •⋅⎔
﹝تـوقـيـع↓📜↓مـمـلكة﹞
┊𝐎𝐒𝐀𝐊𝐀 𓆩💧𓆪 𝐊.𝐍.𝐆┊
⎔⋅• ━ ╼╃ ◈ 〔💧〕 ◈ ╄╾ ━ •⋅⎔
`])} 
 `.trim() 
 conn.reply(m.chat, teks, m, { mentions: { mentionedJid: [m.sender] }}) 
 } 
 handler.customPrefix = /الاستمارة|استمارة/i 
 handler.command = new RegExp 

 export default handler 

 function pickRandom(list) { 
 return list[Math.floor(Math.random() * list.length)] 
 }